package basic;
// 패키지란 여러개의 관련있는 클래스들을 묶어 놓은 것을 말한다.
public class Basic02_print {
//class 란 객체를 생성하기 위한 설계도이다.
	//객체(설계도대로 완성된)가 실행 = 자동차 운행  . 객체를 메모리에 올려서 실행되게 해야함.
//접근제한자란? 클래스, 메서드, 멤버변수의 접근을 제한을 하는 것
	//메서드 = ()
	//변수 : 처리하고자 하는 데이터를 저장하는 기억장소
//접근제한자의 종류 : private, protected, default, public
//public : 접근제한이 없다
	public static void main(String[] args) {
		// 메인메서드 앞에 3가지가 메인메서드를 수식하는것.
		// static : 객체를 생성하지 않고 실행이 가능하게 만든다. 원래 메인메서드를 실행시키려면 객체화해야하는데
		//설계도 사용하려면 객체를 만들어야 하는데 static이 생성되면 객체를 생성하지않고 메인 메서드를 사용ㅎ가능.
			//메인메서드는 반드시 처음에 실행되는것, 맨처음에 호출하는 기능을 갖음.
		// ★void   : 호출한 곳으로 리턴(되돌려 주는 값)해줄 값이 없다
		// 메서드(Metode)란? ~~을 실행하기 위한 기능을 말한다(성적을 내주세요, ~해주세요라는 기능들을 담고있음.) = 엑셀의 함수 sum()
		// main() : 메인 메서드라고 부른다
		//프로젝트를 개발할 때 반드시 메인메서드가 있어야 한다.
		// TODO Aㅕ새-

	}

}
